Autodesk.Revit.DB.IFC.IFCLevelInfo.GetLocalPlacement
Gets the local placement.
Returns:
The local placement.
Since:
2014

Autodesk.Revit.DB.IFC.IFCLevelInfo.GetRelatedElements
Gets all building elements on this level.
Returns:
The collection of elements.
Since:
2013

Autodesk.Revit.DB.IFC.IFCLevelInfo.GetRelatedProducts
Gets all building products on this level.
Returns:
The collection of products.
Since:
2013

Autodesk.Revit.DB.IFC.IFCLevelInfo.GetBuildingStorey
Gets the IfcBuildingStorey handle.
Returns:
The handle.
Since:
2012

Autodesk.Revit.DB.IFC.IFCLevelInfo.Create(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCAnyHandle,System.Double,System.Double,System.Double,System.Boolean)
Creates an IFCLevelInfo.
buildingStorey:
The building storey handle (IfcBuildingStorey).
localPlacement:
The local placement handle (IfcLocalPlacement).
height:
The height of the level.
elevation:
The elevation of the level.
scaleFactor:
The scale factor.
isPrimaryLevel:
True if this is primary level, false otherwise.
Returns:
The IFCLevelInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCLevelInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCLevelInfo.Elevation
The elevation of the level.
Since:
2012

Autodesk.Revit.DB.IFC.IFCLevelInfo.DistanceToNextLevel
The distance to the next story level.
Since:
2012

Autodesk.Revit.DB.IFC.IFCLevelInfo
Represents information about a particular level in the document.
Remarks:
Level information includes the height, which is the distance to from this level
to the next available level, and the actual elevation of the level, in the Revit default units.
Since:
2012